Revit 2026 API

# PDFExportOptionsPaperOrientation Property

---

Paper orientation - Portrait/Landscape/Auto

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PageOrientationType PaperOrientation { get; set; }
```
```vb
Public Property PaperOrientation As PageOrientationType
	Get
	Set
```
```cpp
public:
property PageOrientationType PaperOrientation {
	PageOrientationType get ();
	void set (PageOrientationType value);
}
```
```fsharp
member PaperOrientation : PageOrientationType with get, set
```

#### Property Value

PageOrientationType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

Ignored when the PaperFormat is ExportPaperFormat.Default, which means "Use Sheet Size".

#### Reference

PDFExportOptions Class

Autodesk.Revit.DB Namespace